_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 384, 48)           9984      
_________________________________________________________________
lstm_2 (LSTM)                (None, 384, 48)           18624     
_________________________________________________________________
lstm_3 (LSTM)                (None, 384, 48)           18624     
_________________________________________________________________
lstm_4 (LSTM)                (None, 48)                18624     
_________________________________________________________________
dense_1 (Dense)              (None, 96)                4704      
=================================================================
Total params: 70,560.0
Trainable params: 70,560
Non-trainable params: 0.0
_________________________________________________________________
None
epochs:  20
timesteps:  384
batch_size:  384
prediction_length:  96
features:  3
mape:  10.3105172515
median:  5.940502882
standard_deviation:  10.8300564251
