_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 6, 10)             560       
_________________________________________________________________
lstm_2 (LSTM)                (None, 6, 10)             840       
_________________________________________________________________
lstm_3 (LSTM)                (None, 6, 10)             840       
_________________________________________________________________
lstm_4 (LSTM)                (None, 10)                840       
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 33        
=================================================================
Total params: 3,113
Trainable params: 3,113
Non-trainable params: 0
_________________________________________________________________
None
epochs:  3
timesteps:  6
batch_size:  10
prediction_length:  3
features:  3
mape:  21.2034538388
median:  22.2956322134
standard_deviation:  4.73974276672
