_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (None, 384, 96)           38400     
_________________________________________________________________
lstm_2 (LSTM)                (None, 384, 96)           74112     
_________________________________________________________________
lstm_3 (LSTM)                (None, 384, 96)           74112     
_________________________________________________________________
lstm_4 (LSTM)                (None, 96)                74112     
_________________________________________________________________
dense_1 (Dense)              (None, 96)                9312      
=================================================================
Total params: 270,048.0
Trainable params: 270,048
Non-trainable params: 0.0
_________________________________________________________________
None
epochs:  1
timesteps:  384
batch_size:  384
prediction_length:  96
features:  3
mape:  14.0088602901
median:  7.97404870391
standard_deviation:  12.5733063334
